[
  {
    "title": "Ingénieur DevOps & Backend Senior",
    "company": "BPCE",
    "city": "Paris, France",
    "startDate": "Mai 2024",
    "endDate": "Présent",
    "tasks": [
      "Conception et exploitation d'infrastructures CI/CD sécurisées conformes aux standards bancaires, permettant des mises en production fréquentes.",
      "Développement d'APIs d'automatisation en Python, réduisant les interventions manuelles sur Mainframe de plus de 400 incidents par an.",
      "Déploiement de services web sur OpenShift, améliorant la disponibilité des services et l'autonomie des utilisateurs.",
      "Mise en œuvre de l'automatisation Ansible pour la gestion des certificats Mainframe avec traçabilité complète d'audit.",
      "Collaboration avec les équipes sécurité et infrastructure pour définir des choix d'architecture axés sur la scalabilité et la conformité."
    ]
  },
  {
    "title": "Ingénieur DevOps",
    "company": "Tediber",
    "city": "Paris, France",
    "startDate": "Avril 2023",
    "endDate": "Avril 2024",
    "tasks": [
      "Optimisation des performances d'APIs PHP et réduction du temps de réponse via des améliorations SQL et système.",
      "Réduction des temps de build Docker par l'optimisation des couches (layers) et des stratégies de cache CI.",
      "Développement de scripts d'automatisation Python pour le provisionnement et la gestion du cycle de vie du stockage Cloud.",
      "Gestion et mise à l'échelle de runners GitLab CI sur GKE, garantissant une haute disponibilité des pipelines.",
      "Réalisation de migrations vers Cloud SQL et gestion de workflows CI/CD de niveau production."
    ]
  },
  {
    "title": "Ingénieur DevOps Junior & Développeur Python",
    "company": "Worldline",
    "city": "Lille, France",
    "startDate": "Mars 2020",
    "endDate": "Avril 2023",
    "tasks": [
      "Conception et maintenance de pipelines CI/CD avec GitLab CI pour des déploiements multi-environnements.",
      "Administration des systèmes de monitoring via Zabbix et Grafana pour garantir la fiabilité de la production.",
      "Contribution à l'automatisation applicative en Python et Golang.",
      "Supervision de l'orchestration de conteneurs via Kubernetes et Helm en environnement de production."
    ]
  }
]
